# Pandas Assignment

**Q1. How do you load a CSV file into a Pandas DataFrame?**
<br>Ans. CSV files (comma separated files) are simple way to store big datasets. read_table() and read_csv are the important pandas function to read csv files and create data frame from it.
<br>import pandas as pd
<br>__Syntax 1 :__
df = pd.read_csv("data.csv")
<br>__Syntax 2 :__
ds = pd.read_table("data.csv")

In [3]:
 # Method - 1
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [6]:
# Method - 2
ds = pd.read_table('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
ds

    PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0    1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/...
1    2,1,1,"Cumings, Mrs. John Bradley (Florence Br...
2    3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,S...
3    4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May ...
4    5,0,3,"Allen, Mr. William Henry",male,35,0,0,3...
..                                                 ...
886  887,0,2,"Montvila, Rev. Juozas",male,27,0,0,21...
887  888,1,1,"Graham, Miss. Margaret Edith",female,...
888  889,0,3,"Johnston, Miss. Catherine Helen ""Car...
889  890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,11...
890  891,0,3,"Dooley, Mr. Patrick",male,32,0,0,3703...

[891 rows x 1 columns]

**Q2. How do you check the data type of a column in a Pandas DataFrame?**
<br>Ans. To check the data type in pandas DataFrame we can use the “dtype” attribute. The attribute returns a series with the data type of each column.
<br>For a single column: dataframe.column_name.dtype 
<br>For all columns: dataframe.dtypes

In [7]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [14]:
df.Age.dtype

dtype('float64')

__Q3. How do you select rows from a Pandas DataFrame based on a condition?__
<br> Ans. Rows from pandas DataFrame can be filtered based on a single condition or multiple conditions either using 
1. DataFrame.loc[] attribute 
2. DataFrame.query() 
3. DataFrame.apply() method.

__Q4. How do you rename columns in a Pandas DataFrame?__
<br>Ans. One way of renaming the columns in a Pandas Dataframe is by using the rename() function. This method is quite useful when we need to rename some selected columns.

__Syntax :__ dataFrame.rename(columns={'oldName1': 'newName1', 'oldName2': 'newName2'})

In [4]:
technologies = ({
  'Courses':["Spark","PySpark","Hadoop","Python","pandas","Oracle","Java"],
  'Fee' :[20000,25000,26000,22000,24000,21000,22000],
  'Duration':['30day', '40days' ,'35days', '40days', '60days', '50days', '55days']
              })
df = pd.DataFrame(technologies)
print(df.columns)
df

# Rename a Single Column 
df=df.rename(columns = {'Courses':'Courses_List'})
print(df.columns)
      
# Rename multiple columns
df.rename(columns = {'Courses':'Courses_List','Fee':'Courses_Fee', 
   'Duration':'Courses_Duration'}, inplace = True)
print(df.columns)

Index(['Courses', 'Fee', 'Duration'], dtype='object')
Index(['Courses_List', 'Fee', 'Duration'], dtype='object')
Index(['Courses_List', 'Courses_Fee', 'Courses_Duration'], dtype='object')

__Q5. How do you drop columns in a Pandas DataFrame?__
<br>Ans. The drop() method removes the specified row or column.

__Syntax :__ df = dataframe.drop('column_name', axis=1)
<br>where 1 is the axis number (0 for rows and 1 for columns.)
<br>To delete the column without reassign df is:
df.drop('column_name', axis=1, inplace=True)

In [13]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df

# Drop column by index
df2=df.drop(df.columns[2], axis = 1)
print(df2.columns)

# Drop multiple columns by Index
df2=df.drop(df.columns[[0,1]], axis = 1)
print(df2.columns)

# Drop single column by Name
df2=df.drop(["Fare"], axis = 1)
print(df2.columns)

# Drop multiple columns by Name
df2=df.drop(["Sex", "Age"], axis = 1)
print(df2.columns)

Index(['PassengerId', 'Survived', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Index(['Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare',
       'Cabin', 'Embarked'],
      dtype='object')
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Cabin', 'Embarked'],
      dtype='object')
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

__Q6. How do you find the unique values in a column of a Pandas DataFrame?__
<br>Ans. You can get unique values in column (multiple columns) from pandas DataFrame using unique() method.

__Syntax :__ dataframe['column_name'].unique()

In [47]:
technologies = ({
  'Courses':["Spark","PySpark","Hadoop","Python","pandas","Oracle","Java"],
  'Fee' :[20000,25000,26000,22000,24000,21000,22000],
  'Duration':['30day', '40days' ,'35days', '40days', '60days', '50days', '55days'],
  'D':['D1', 'D2', 'D2', 'D2', 'D2', 'D3', 'D4'], 
  'E':['E1', 'E1', 'E1', 'E1', 'E1','E1', 'E1']
              })
df1 = pd.DataFrame(technologies)

# Find unique values of a column
print(df1['Duration'].unique())
print(df1.E.unique())

# Using pandas.unique() to unique values in multiple columns
df2=pd.unique(df1[['D', 'Courses']].values.ravel('k'))
print(df2)

# unique values with drop_duplicates
df1.E.drop_duplicates()

['30day' '40days' '35days' '60days' '50days' '55days']
['E1']
['D1' 'D2' 'D3' 'D4' 'Spark' 'PySpark' 'Hadoop' 'Python' 'pandas' 'Oracle'
 'Java']

0    E1
Name: E, dtype: object

__Q7. How do you find the number of missing values in each column of a Pandas DataFrame?__
<br>Ans. Count NaN or missing values in Pandas DataFrame using isnull() and sum() method of the DataFrame. Pandas isnull() function detect missing values in the given object.

__Syntax :__ DataFrame.isnull()
<br>Missing values gets mapped to True and non-missing value gets mapped to False.
<br>sum() function return the sum of the values for the requested axis.
<br>We can also count the NaN values in Pandas DataFrame using the isna() function and with the sum() function.

In [22]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
# Count total NaN at each column in a DataFrame
print(df.isnull().sum())

# Count total NaN in a DataFrame
print(df.isnull().sum().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64
866

In [4]:
# METHOD 2

df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
# Count the NaN values in single column
print(df['Age'].isna().sum())

177

In [5]:
# Count NaN values in multiple columns of DataFrame
print(df.isna().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
# Count NaN values of whole DataFrame
print(df.isna().sum().sum())

866

In [7]:
# Count the NaN values in multiple rows
print(df.isna().sum(axis = 1))

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

__Q8. How do you fill missing values in a Pandas DataFrame with a specific value?__
<br>Ans. To replace missing values (NaN) in Pandas DataFrame, use the fillna() method. 

__Syntax :__ dataframe.fillna(value, method, axis, inplace, limit, downcast)
<br>Parameters –
  1. value: Specifies the value to replace the NULL values with.
         This can also be values for the entire row or column.
  2. method:	Specifies the method to use when replacing ('backfill', 'bfill', 'pad','ffill', None(default)). 
  3. axis:	default 0. The axis to fill the NULL values along
  4. inplace: default False. If True: the replacing is done on the current DataFrame.
           If False: returns a copy where the replacing is done.
  5. limit:	default None. Specifies the maximum number of NULL values to fill (if method is specified)
  6. downcast:	A dictionary of values to fill for specific data types

In [8]:
import numpy as np
Values = {'First':[100, 90, np.nan, 95],
        'Second': [30, 45, 56, np.nan],
        'Third':[np.nan, 40, 80, 98]}
df2 = pd.DataFrame(Values)

# fillna() on all columns
print(df2.fillna('None'))

   First Second Third
0  100.0   30.0  None
1   90.0   45.0  40.0
2   None   56.0  80.0
3   95.0   None  98.0

In [9]:
# fillna() on once column
print(df2['First'].fillna(0))

0    100.0
1     90.0
2      0.0
3     95.0
Name: First, dtype: float64

In [10]:
# fillna() on multiple columns
print(df2[['First','Second']].fillna(0))

   First  Second
0  100.0    30.0
1   90.0    45.0
2    0.0    56.0
3   95.0     0.0

In [11]:
# fillna() on multiple columns with different values
print(df2.fillna(value={'Second':'None','Third':10000}))

   First Second    Third
0  100.0   30.0  10000.0
1   90.0   45.0     40.0
2    NaN   56.0     80.0
3   95.0   None     98.0

__Q8. How do you fill missing values in a Pandas DataFrame with a specific value?__
<br>Ans. To replace missing values (NaN) in Pandas DataFrame, use the fillna() method. 
__Syntax:__ dataframe.fillna(value, method, axis, inplace, limit, downcast)
<br> Parameters-

  1. value: Specifies the value to replace the NULL values with.
     - This can also be values for the entire row or column.
  2. method:	Specifies the method to use when replacing ('backfill', 'bfill', 'pad','ffill', None(default)). 
  3. axis: default 0. The axis to fill the NULL values along
  4. inplace: default False. 
     - If True: the replacing is done on the current DataFrame.
     -If False: returns a copy where the replacing is done.
  5. limit:	default None. Specifies the maximum number of NULL values to fill (if method is specified)
  6. downcast: A dictionary of values to fill for specific data types

__Q9. How do you concatenate two Pandas DataFrames?__
<br>Ans. A concatenation of two or more data frames can be done using *pandas.concat()* method. 
<br>concat() in pandas works by combining Data Frames across rows or columns.
<br>Use axis=0 to concat along rows, axis=1 to concat along columns.

In [14]:
df = pd.DataFrame({'Courses': ["Spark","PySpark","Python","pandas"],
                    'Fee' : [20000,25000,22000,24000]})

df1 = pd.DataFrame({'Courses': ["Pandas","Hadoop","Hyperion","Java"],
                    'Fee': [25000,25200,24500,24900]})
# To concat two DataFrame
ds=pd.concat([df, df1])
display(ds)

    Courses    Fee
0     Spark  20000
1   PySpark  25000
2    Python  22000
3    pandas  24000
0    Pandas  25000
1    Hadoop  25200
2  Hyperion  24500
3      Java  24900

In [19]:
# Use pandas.concat() method to ignore_index
ds = pd.concat([df, df1], ignore_index=True)
display(ds)

    Courses    Fee
0     Spark  20000
1   PySpark  25000
2    Python  22000
3    pandas  24000
4    Pandas  25000
5    Hadoop  25200
6  Hyperion  24500
7      Java  24900

In [20]:
df3 = pd.DataFrame({'Courses':["Spark","PySpark","Python","pandas"],
                      'Fee' :[20000,25000,22000,24000]})
  
df4 = pd.DataFrame({'Duration':['30day','40days','35days','60days'],
                      'Discount':[1000,2300,2500,2000,]}) 
# concatenating df3 and df4 along columns
ds = pd.concat([df3, df4], axis=1)
display(ds)

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Python  22000   35days      2500
3   pandas  24000   60days      2000

__Q10. How do you merge two Pandas DataFrames on a specific column?__
<br>Ans. Pandas merge() function is used to merge multiple Dataframes. 
<br>We can use either *pandas.merge()* or *DataFrame.merge()* to merge multiple Dataframes.

In [35]:
# creating a dataframe
ds1 = pd.DataFrame({'Name':['Raju', 'Rani', 'Geeta', 'Sita', 'Sohit'],
                    'Marks':[80, 90, 75, 88, 59]})
# creating another dataframe with different data
ds2 = pd.DataFrame({'Name':['Raju', 'Divya', 'Geeta', 'Sita'],
                    'Grade':['A', 'A', 'B', 'A'],
                    'Rank':[3, 1, 4, 2 ],
                    'Gender':['Male', 'Female', 'Female', 'Female']})

# display ds1
display(ds1)
  
# display ds2
display(ds2)

# applying merge on two dataframes
ds1.merge(ds2)

    Name  Marks
0   Raju     80
1   Rani     90
2  Geeta     75
3   Sita     88
4  Sohit     59

    Name Grade  Rank  Gender
0   Raju     A     3    Male
1  Divya     A     1  Female
2  Geeta     B     4  Female
3   Sita     A     2  Female

    Name  Marks Grade  Rank  Gender
0   Raju     80     A     3    Male
1  Geeta     75     B     4  Female
2   Sita     88     A     2  Female

In [37]:
# applying merge with multiple columns
ds1.merge(ds2[['Name', 'Grade', 'Rank']])

    Name  Marks Grade  Rank
0   Raju     80     A     3
1  Geeta     75     B     4
2   Sita     88     A     2

In [41]:

  
# creating another dataframe with different data
ds3 = pd.DataFrame({'Name':['Raju', 'Divya', 'Geeta', 'Sita'],
                    'Marks':[8, 9, 7.5, 8.5],
                    'Grade':['A', 'A', 'B', 'A'],
                    'Rank':[3, 1, 4, 2 ]})

# merge with similar column names in both the dataframes which are not in join key 
ds4=ds1.merge(ds3, on='Name')
# display ds4
display(ds4)


# Merge two Dataframes on column 'ID' with custom suffix for non-key common columns
ds5=ds1.merge(ds3, on='Name',suffixes=('_In_Percent', '_In_Cgpa'))
# display ds5
display(ds5)

    Name  Marks_x  Marks_y Grade  Rank
0   Raju       80      8.0     A     3
1  Geeta       75      7.5     B     4
2   Sita       88      8.5     A     2

    Name  Marks_In_Percent  Marks_In_Cgpa Grade  Rank
0   Raju                80            8.0     A     3
1  Geeta                75            7.5     B     4
2   Sita                88            8.5     A     2

__Q11. How do you group data in a Pandas DataFrame by a specific column and apply an aggregation function?__
<br>Ans. *Dataframe.aggregate()* function is used to apply some aggregation across one or more column.

__Q12. How do you pivot a Pandas DataFrame?__
<br>Ans. The pivot() function is used to reshaped a given DataFrame organized by given index / column values. 

__Syntax :__ dataFrame.pivot(self, index=None, columns=None, values=None)
<br>Parameters –
  1. index: Column for making new frame’s index. If None, uses existing index.
  2. columns: Column for new frame’s columns.
  3. values: Column(s) for populating new frame’s values. If not specified, all remaining columns will be used and the result will have hierarchically indexed columns.

In [44]:
df = pd.DataFrame({'Number': ['one', 'one', 'one', 'two', 'two',
                           'two'],
                   'Alpha': ['P', 'Q', 'R', 'P', 'Q', 'R'],
                   'Digit': [2, 3, 4, 5, 6, 7],
                   'Roman': ['I', 'IV', 'X', 'II', 'V', 'IX']})
display(df)
df.pivot(index='Number', columns='Alpha', values='Digit')

  Number Alpha  Digit Roman
0    one     P      2     I
1    one     Q      3    IV
2    one     R      4     X
3    two     P      5    II
4    two     Q      6     V
5    two     R      7    IX

Alpha   P  Q  R
Number
one     2  3  4
two     5  6  7

In [45]:
# value with list
df.pivot(index ='Number', columns ='Alpha', values =['Digit', 'Roman'])

       Digit       Roman
Alpha      P  Q  R     P   Q   R
Number
one        2  3  4     I  IV   X
two        5  6  7    II   V  IX

__Q13. How do you change the data type of a column in a Pandas DataFrame?__
<br>Ans. There are different ways of changing DataType for one or more columns in Pandas Dataframe.
<br>*DataFrame.astype()* method is used to cast pandas object to a specified dtype.

In [47]:
# creating dataframe with different data
ds3 = pd.DataFrame({'Name':['Raju', 'Divya', 'Geeta', 'Sita'],
                    'Marks':[8, 9, 7.5, 8.5],
                    'Grade':['A', 'A', 'B', 'A'],
                    'Rank':[3, 1, 4, 2 ]})
#show the datatypes
print(ds3.dtypes)

Name      object
Marks    float64
Grade     object
Rank       int64
dtype: object

In [48]:
# converting all columns to string type
ds = ds3.astype(str)
print(ds.dtypes)

Name     object
Marks    object
Grade    object
Rank     object
dtype: object

In [59]:
# convert data type of marks column into integer
ds3.Marks = ds3.Marks.astype(int)

# show the dataframe
print(ds3)

print(ds3.dtypes)

    Name  Marks Grade  Rank
0   Raju      8     A     3
1  Divya      9     A     1
2  Geeta      7     B     4
3   Sita      8     A     2
Name     object
Marks     int64
Grade    object
Rank      int64
dtype: object


__Q14. How do you sort a Pandas DataFrame by a specific column?__
<br>Ans.To sort the DataFrame based on the values in a single column, you’ll use *.sort_values()*. By default, this will return a new DataFrame sorted in ascending order. 

__Syntax :__ DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind=’quicksort’, na_position=’last’)
<br>Parameters :
  1. by: Single/List of column names to sort Data Frame by.

  2. axis: 0 or ‘index’ for rows and 1 or ‘columns’ for Column.

  3. ascending: Boolean value which sorts Data frame in ascending order if True.

  4. inplace: Boolean value. Makes the changes in passed data frame itself if True.

  5. kind: String which can have three inputs(‘quicksort’, ‘mergesort’ or ‘heapsort’) of the algorithm used to sort data frame.

  6. na_position: Takes two string input ‘last’ or ‘first’ to set position of Null values. Default is ‘last’.

In [13]:
data = ({
    'Courses':["Spark","Hadoop","pandas","Java","Spark","Pyspark"],
    'Fee' :[20000,25000,30000,22000,26000, 26000],
    'Duration':['40days','40days','35days','60days','30days','50days'],
    'Discount':[1000,2500,1500,1200,2000,3000]
               })
df = pd.DataFrame(data, index = ['1','2','3','4','5','6'])
print(df)


# Sort the rows of dataframe by 'Courses' column
df1 = df.sort_values('Courses')
print(df1)

   Courses    Fee Duration  Discount
1    Spark  20000   40days      1000
2   Hadoop  25000   40days      2500
3   pandas  30000   35days      1500
4     Java  22000   60days      1200
5    Spark  26000   30days      2000
6  Pyspark  26000   50days      3000
   Courses    Fee Duration  Discount
2   Hadoop  25000   40days      2500
4     Java  22000   60days      1200
6  Pyspark  26000   50days      3000
1    Spark  20000   40days      1000
5    Spark  26000   30days      2000
3   pandas  30000   35days      1500

In [14]:
# column in Descending Order
df2=df.sort_values(by = 'Courses', ascending = False)
print(df2)

   Courses    Fee Duration  Discount
3   pandas  30000   35days      1500
1    Spark  20000   40days      1000
5    Spark  26000   30days      2000
6  Pyspark  26000   50days      3000
4     Java  22000   60days      1200
2   Hadoop  25000   40days      2500

In [15]:
# Sort by multiple columns
df3 = df.sort_values(by=['Courses','Duration'])
print(df3)

   Courses    Fee Duration  Discount
2   Hadoop  25000   40days      2500
4     Java  22000   60days      1200
6  Pyspark  26000   50days      3000
5    Spark  26000   30days      2000
1    Spark  20000   40days      1000
3   pandas  30000   35days      1500

In [17]:
# Sort and ignore index
df4 = df.sort_values(by='Courses', ignore_index=True)
print(df4)

   Courses    Fee Duration  Discount
0   Hadoop  25000   40days      2500
1     Java  22000   60days      1200
2  Pyspark  26000   50days      3000
3    Spark  20000   40days      1000
4    Spark  26000   30days      2000
5   pandas  30000   35days      1500

__Q15. How do you create a copy of a Pandas DataFrame?__
<br>Ans. The copy() method returns a copy of the DataFrame.

__Syntax :__ dataframe.copy(deep)
<br>Parameter:
  1. Deep:	Optional. Specifies whether to make a deep or a shallow copy. By default (deep=True, any changes made in the original DataFrame will not be reflected in the copy.
      - deep=False, it is only the reference to the data (and index) that will be copied, and any changes made in the original will be reflected in the copy, and, any changes made in the copy will be reflected in the original.

In [26]:
# creating a dataframe
df = pd.DataFrame({'Name':['Raju', 'Rani', 'Geeta', 'Sita', 'Sohit'],
                    'Marks':[80, 90, 75, 88, 59]})

display(df)

# copy the dataframe df to 
copy_df= df.copy(deep=True)
print(copy_df)

    Name  Marks
0   Raju     80
1   Rani     90
2  Geeta     75
3   Sita     88
4  Sohit     59

    Name  Marks
0   Raju     80
1   Rani     90
2  Geeta     75
3   Sita     88
4  Sohit     59

__Q16. How do you filter rows of a Pandas DataFrame by multiple conditions?__
<br>Ans. By using df[], loc[], query(), eval() and numpy.where() we can filter Pandas DataFrame by multiple conditions.

In [7]:
data = ({
    'Courses':["Spark","Hadoop","pandas","Java","Spark","Pyspark"],
    'Fee' :[20000,25000,30000,22000,26000, 26000],
    'Duration':['40days','40days','35days','60days','30days','50days'],
    'Discount':[1000,2500,1500,1200,2000,3000]
               })
df = pd.DataFrame(data)
# filter rows by a condition in pandas DataFrame using df
df2=df[df["Courses"] == 'Spark'] 
print(df2)

  Courses    Fee Duration  Discount
0   Spark  20000   40days      1000
4   Spark  26000   30days      2000

In [8]:
# filter rows by a condition in pandas DataFrame using query
df2=df.query("Courses == 'Spark'")
print(df2)

  Courses    Fee Duration  Discount
0   Spark  20000   40days      1000
4   Spark  26000   30days      2000

In [9]:
# filter rows by a condition in pandas DataFrame using .loc
df2=df.loc[df['Courses'] == "Spark"]
print(df2)

  Courses    Fee Duration  Discount
0   Spark  20000   40days      1000
4   Spark  26000   30days      2000

In [14]:
# Use DataFrame.eval() to filter by multiple conditions
df2 =df[df.eval("Fee <= 25000 & (Discount < 2300) & Courses.str.startswith('S').values")]
print(df2)

  Courses    Fee Duration  Discount
0   Spark  20000   40days      1000

In [15]:
# Use DataFrame.query() to filter by multiple conditions
df2 = df.query('Fee  >= 22000 & Discount < 3000 & Courses.str.startswith("H").values')
print(df2)

  Courses    Fee Duration  Discount
1  Hadoop  25000   40days      2500

__Q17. How do you calculate the mean of a column in a Pandas DataFrame?__
<br>Ans. Pandas *dataframe.mean()* function return the mean of the values for the requested axis.

 __Syntax :__ DataFrame.mean(axis=None, skipna=None, level=None, numeric_only=None, **kwargs)
<br>Parameters :
  1. axis : {index (0), columns (1)}
  2. skipna : Exclude NA/null values when computing the result
  3. level : If the axis is a MultiIndex (hierarchical), count along a particular level, collapsing into a Series
  4. numeric_only : Include only float, int, boolean columns. If None, will attempt to use everything, then use only numeric data. Not implemented for Series.

In [29]:
# Creating the dataframe 
df = pd.DataFrame({"A":[12, 4, 5, 44, 1],
                   "B":[5, 2, 54, 3, 2], 
                   "C":[20, 16, 7, 3, 8],
                   "D":[14, 3, 17, 2, 6]})
display(df)
# Using DataFrame.mean() to get entire column mean
df2 = df.mean()
print(df2)

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  54   7  17
3  44   3   3   2
4   1   2   8   6

A    13.2
B    13.2
C    10.8
D     8.4
dtype: float64

In [17]:
# Using DataFrame.mean() method to get column average
df2 = df["C"].mean()
print(df2)

10.8

In [18]:
# Using multiple columns mean using DataFrame.mean()
df2 = df[["A","D"]].mean()
print(df2)

A    13.2
D     8.4
dtype: float64

In [4]:
# Creating the dataframe 
df = pd.DataFrame({"A":[12, 4, 5, None, 1],
                   "B":[7, 2, 54, 3, None],
                   "C":[20, 16, 11, 3, 8],
                   "D":[14, 3, None, 2, 6]})
  
# skip the Na values while finding the mean
df.mean(axis = 1, skipna = True)

0    13.250000
1     6.250000
2    23.333333
3     2.666667
4     5.000000
dtype: float64

__Q18. How do you calculate the standard deviation of a column in a Pandas DataFrame?__
<br>Ans. DataFrame.std() function to calculate the standard deviation of values in a pandas DataFrame.
  - Calculate Standard Deviation of All Numeric Columns: *df.std()*
  - Calculate Standard Deviation of One Column: *df['column_name'].std()*
  - Calculate Standard Deviation of Multiple Columns: *df[['column_name1','column_name2']].std()*

In [32]:
# Creating the dataframe 
df = pd.DataFrame({"A":[12, 4, 5, 44, 1],
                   "B":[5, 2, 54, 3, 2], 
                   "C":[20, 16, 7, 3, 8],
                   "D":[14, 3, 17, 2, 6]})
display(df)
# Using DataFrame.std() to get entire column 
df2 = df.std()
print(df2)

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  54   7  17
3  44   3   3   2
4   1   2   8   6

A    17.683325
B    22.840753
C     6.978539
D     6.730527
dtype: float64

In [31]:
# Creating the dataframe 
df = pd.DataFrame({"A":[12, 4, 5, None, 1],
                   "B":[7, 2, 54, 3, None],
                   "C":[20, 16, 11, 3, 8],
                   "D":[14, 3, None, 2, 6]})
  
# skip the Na values while finding the std
df.std(axis = 1, skipna = True)

0     5.377422
1     6.551081
2    26.727015
3     0.577350
4     3.605551
dtype: float64

__Q19. How do you calculate the correlation between two columns in a Pandas DataFrame?__
<br>Ans. Pandas dataframe.corr() is used to find the pairwise correlation of all columns in the Pandas Dataframe in Python. Any NaN values are automatically excluded. Any non-numeric data type or columns in the Dataframe, it is ignored.
 
 __Syntax :__ DataFrame.corr(self, method=’pearson’, min_periods=1) 
<br>Parameters: 
 1. method: 
    - pearson: standard correlation coefficient 
    - kendall: Kendall Tau correlation coefficient 
    - spearman: Spearman rank correlation
 2. min_periods: Minimum number of observations required per pair of columns to have a valid result. Currently only available for pearson and spearman correlation

In [33]:
# Creating the dataframe 
df = pd.DataFrame({"A":[12, 4, 5, 44, 1],
                   "B":[5, 2, 54, 3, 2], 
                   "C":[20, 16, 7, 3, 8],
                   "D":[14, 3, 17, 2, 6]})
display(df)
# Correlation between all the columns of DataFrame.
df2 = df.corr()
print(df2)

    A   B   C   D
0  12   5  20  14
1   4   2  16   3
2   5  54   7  17
3  44   3   3   2
4   1   2   8   6

          A         B         C         D
A  1.000000 -0.247091 -0.473648 -0.410442
B -0.247091  1.000000 -0.278867  0.744160
C -0.473648 -0.278867  1.000000  0.252293
D -0.410442  0.744160  0.252293  1.000000

In [35]:
# Correlation between two columns of DataFrame.
corr=df['A'].corr(df['D'])
print(corr)

-0.4104417460156906

__Q20. How do you select specific columns in a DataFrame using their labels?__
<br>Ans. The basic way to select a single column from a dataframe, just put the string name of the column in brackets[], *df['columnname']*
<br>Passing a list in the brackets lets you select multiple columns at the same time, *df['columnname1','columnname2','columnname3']*
<br>The .loc[] function selects the data by labels of rows or columns.
  - To select single column: *df.loc[['columnname']]*
  - To select multiple columns: *df.loc[['columnname1','columnname2','columnname3']]*
  - To select all rows and particular list of columns: *df.loc[:,['columnname1','columnname2','columnname3']]*

In [3]:
data = ({
    'Courses':["Spark","Hadoop","pandas","Java","Spark","Pyspark"],
    'Fee' :[20000,25000,30000,22000,26000, 26000],
    'Duration':['40days','40days','35days','60days','30days','50days'],
    'Discount':[1000,2500,1500,1200,2000,3000]
               })
df = pd.DataFrame(data)
display(df)

# Using the operator [] to select a column
rlt = df["Courses"]
display(rlt)

   Courses    Fee Duration  Discount
0    Spark  20000   40days      1000
1   Hadoop  25000   40days      2500
2   pandas  30000   35days      1500
3     Java  22000   60days      1200
4    Spark  26000   30days      2000
5  Pyspark  26000   50days      3000

0      Spark
1     Hadoop
2     pandas
3       Java
4      Spark
5    Pyspark
Name: Courses, dtype: object

In [39]:
# By using df[] Notation select multile columns
df2 = df[["Courses","Fee"]] 
display(df2)

   Courses    Fee
0    Spark  20000
1   Hadoop  25000
2   pandas  30000
3     Java  22000
4    Spark  26000
5  Pyspark  26000

In [4]:
# Select Random columns # Select columns by range
df2 = df.loc[:, ["Courses","Fee","Discount"]] 
display(df2)

   Courses    Fee  Discount
0    Spark  20000      1000
1   Hadoop  25000      2500
2   pandas  30000      1500
3     Java  22000      1200
4    Spark  26000      2000
5  Pyspark  26000      3000

__Q21. How do you select specific rows in a DataFrame using their indexes?__
<br>Ans. One can select a single row from pandas DataFrame by integer index using *df.iloc[r]*. Replace r with a position you wanted to select.
<br>Multiple rows from DataFrame can be selected by specifying indexes as a list. You can do this by *df.iloc[[r1, r2, r3]]*. r1,r2,r3 are indices.
<br>DataFrame can be selected by the range of Indexes, provide start and stop indexes, *df.iloc[startindex: stopindex]*

In [6]:
data = ({
    'Courses':["Spark","Hadoop","pandas","Java","Spark","Pyspark"],
    'Fee' :[20000,25000,30000,22000,26000, 26000],
    'Duration':['40days','40days','35days','60days','30days','50days'],
    'Discount':[1000,2500,1500,1200,2000,3000]
               })
df = pd.DataFrame(data)
display(df)
# Select Row by Integer Index
display(df.iloc[2])

   Courses    Fee Duration  Discount
0    Spark  20000   40days      1000
1   Hadoop  25000   40days      2500
2   pandas  30000   35days      1500
3     Java  22000   60days      1200
4    Spark  26000   30days      2000
5  Pyspark  26000   50days      3000

Courses     pandas
Fee          30000
Duration    35days
Discount      1500
Name: 2, dtype: object

In [9]:
# Select Rows by Index List
print(df.iloc[[2,3,5]])

   Courses    Fee Duration  Discount
2   pandas  30000   35days      1500
3     Java  22000   60days      1200
5  Pyspark  26000   50days      3000

In [10]:
# Select Rows by Integer Index Range
print(df.iloc[1:4])

  Courses    Fee Duration  Discount
1  Hadoop  25000   40days      2500
2  pandas  30000   35days      1500
3    Java  22000   60days      1200

__Q22. How do you sort a DataFrame by a specific column?__
<br>Ans. To sort the DataFrame based on the values in a single column, you’ll use *.sort_values()*. By default, this will return a new DataFrame sorted in ascending order. 

 __Syntax :__ DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind=’quicksort’, na_position=’last’)
<br>Parameters :
  1. by: Single/List of column names to sort Data Frame by.

  2. axis: 0 or ‘index’ for rows and 1 or ‘columns’ for Column.

  3. ascending: Boolean value which sorts Data frame in ascending order if True.

  4. inplace: Boolean value. Makes the changes in passed data frame itself if True.

  5. kind: String which can have three inputs(‘quicksort’, ‘mergesort’ or ‘heapsort’) of the algorithm used to sort data frame.

  6. na_position: Takes two string input ‘last’ or ‘first’ to set position of Null values. Default is ‘last’.

__Q23. How do you create a new column in a DataFrame based on the values of another column?__
<br>Ans. One can add/append a new column to the DataFrame based on the values of another column using
1. df.assign()
2. df.apply()
3. By directly performing arithmetic operations on existing columns and assign the result as a new column to DataFrame.
4. df.map()

__Q24. How do you remove duplicates from a DataFrame?__
<br>Ans. Pandas drop_duplicates() method helps in removing duplicates from the Pandas Dataframe In Python.

 __Syntax :__ DataFrame.drop_duplicates(subset=None, keep=’first’, inplace=False)
<br>Parameters:

  1. subset: Subset takes a column or list of column label. It’s default value is none. After passing columns, it will consider them only for duplicates.

  2. keep: keep is to control how to consider duplicate value. It has only three distinct value and default is ‘first’. 
        - If ‘first‘, it considers first value as unique and rest of the same values as duplicate.
        - If ‘last‘, it considers last value as unique and rest of the same values as duplicate.
        - If False, it consider all of the same values as duplicates

  3. inplace: Boolean values, removes rows with duplicates if True.

In [16]:
data = {
    "A": ["TeamA", "TeamB", "TeamB", "TeamC", "TeamA"],
    "B": [50, 40, 40, 30, 50],
    "C": [True, False, False, False, True]
}
df = pd.DataFrame(data)
display(df)

# duplicate row
df2 = df.drop_duplicates()
print(df2)

       A   B      C
0  TeamA  50   True
1  TeamB  40  False
2  TeamB  40  False
3  TeamC  30  False
4  TeamA  50   True

       A   B      C
0  TeamA  50   True
1  TeamB  40  False
3  TeamC  30  False

In [17]:
# keep last duplicate row
df2 = df.drop_duplicates( keep='last')
print(df2)

       A   B      C
2  TeamB  40  False
3  TeamC  30  False
4  TeamA  50   True

__Q25. What is the difference between .loc and .iloc in Pandas?__
<br>Ans. They are used for slicing data from the Pandas DataFrame.  They are used in filtering the data according to some conditions. 
<br>The *.loc()* function is label based data selecting method which means that we have to pass the name of the row or column which we want to select. 
<br>The *iloc()* function is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. 
<br>*iloc()* does not include the last element of the range passed in it, unlike .loc()